{
    "id": "nam-art",
    "name": "Nam Art",
    "tagline": "Nghệ thuật Đương đại - Năng lượng Vibrant cho Không gian Sống",
    "owner": "Nam",
    "keywords": [
        "Nghệ thuật đương đại",
        "Vibrant",
        "Cộng hưởng",
        "Không gian sống",
        "Trừu tượng",
        "Văn hóa"
    ],
    "brandEssence": {
        "coreBelief": "Nghệ thuật đương đại không phải để khoe khoang - đó là cầu nối giữa tâm hồn con người và không gian sống, là nguồn năng lượng vibrant nuôi dưỡng tinh thần mỗi ngày.",
        "uniquePromise": "Mang đến những tác phẩm hội họa và điêu khắc đương đại, trừu tượng và ấn tượng sâu sắc - vừa cộng hưởng với cảm xúc, vừa chuyển hóa năng lượng không gian sống của bạn.",
        "transformation": "Từ 'Không gian trống rỗng, thiếu hồn, năng lượng trì trệ' → 'Ngôi nhà tràn đầy nghệ thuật vibrant, cộng hưởng sâu sắc, thể hiện vị thế văn hóa tinh tế'.",
        "enemy": "Nghệ thuật đại trà nhàm chán, không gian sống vô hồn thiếu năng lượng, hình ảnh 'trọc phú không gu', sự xa rời với nghệ thuật đương đại do thiếu kênh tiếp cận.",
        "signatureMethod": "Curator's Touch: Khám phá họa sĩ tài năng với phong cách đương đại độc đáo + Tư vấn bố cục không gian để tác phẩm 'sống' trong ngôi nhà + Kết nối cảm xúc qua câu chuyện nghệ sĩ và thông điệp tác phẩm.",
        "socialProof": "Những người sở hữu nghệ thuật đương đại không chỉ có không gian đẹp, mà còn được công nhận là người có chiều sâu văn hóa, gu thẩm mỹ tinh tường, và khả năng cảm nhận nghệ thuật tiên phong."
    },
    "description": [
        "Cầu nối giữa nghệ thuật đương đại và những người đang phát triển cảm nhận nghệ thuật, tìm kiếm tác phẩm để nâng tầm không gian sống.",
        "Mỗi tác phẩm hội họa và điêu khắc đều mang phong cách đương đại, trừu tượng và ấn tượng sâu sắc - không chỉ để ngắm nhìn, mà để cảm nhận và cộng hưởng.",
        "Giúp bạn giám tuyển không gian hoàn hảo, khám phá nghệ sĩ tài năng mới, cộng hưởng cảm xúc sâu sắc, chuyển hóa năng lượng không gian, và thể hiện vị thế văn hóa."
    ]
}