[
    {
        "id": "ins-1",
        "title": "Decoration vs. Art (Trang trí và Nghệ thuật)",
        "tension": "Bạn bỏ tiền tỷ xây nhà nhưng lại treo một bức tranh in vài trăm nghìn. Nó giống như mặc vest hàng hiệu mà đi dép tổ ong. Sự lệch pha này làm giảm giá trị không gian.",
        "belief": "Tranh nào chả là tranh, đẹp là được.",
        "core": "Đồ trang trí làm đầy không gian (Fill Space), còn Nghệ thuật làm đầy tâm hồn (Fill Soul). Bạn đang cần 'Năng lượng' (Vibration), không phải 'Vật lấp chỗ trống'.",
        "reframe": "Đừng decor nhà, hãy thổi hồn cho nó.",
        "mechanism": "Soulful Space Curation."
    },
    {
        "id": "ins-2",
        "title": "The Discovery Gap (Khoảng trống Khám phá)",
        "tension": "Bạn có tiền và có gu, nhưng bạn không có thời gian đi lùng sục các xưởng vẽ hay gallery để tìm 'viên ngọc thô'. Bạn sợ bỏ lỡ những tài năng mới.",
        "belief": "Mua tranh đẹp khó lắm.",
        "core": "Thế giới nghệ thuật rất rộng lớn nhưng khép kín. Bạn cần một cây cầu nối (Bridge) tin cậy để tiếp cận những tác phẩm đương đại chất lượng.",
        "reframe": "Nam Art là người tuyển trạch (Curator) mang tinh hoa đến tận cửa nhà bạn.",
        "mechanism": "Exclusive Access."
    },
    {
        "id": "ins-3",
        "title": "Art as Mirror (Nghệ thuật là Tấm gương)",
        "tension": "Nhìn vào bộ sưu tập tranh của một người, ta biết họ là ai. Bạn muốn người khác nhìn thấy sự phóng khoáng, sâu sắc của mình, nhưng những gì bạn đang treo chưa nói lên điều đó.",
        "belief": "Tranh chỉ là vật ngoại thân.",
        "core": "Tác phẩm bạn chọn là tuyên ngôn không lời về bản sắc (Identity) của bạn. Nó phản chiếu thế giới nội tâm của gia chủ.",
        "reframe": "Chọn tranh là chọn cách bạn giới thiệu tâm hồn mình với thế giới.",
        "mechanism": "Identity Reflection."
    },
    {
        "id": "ins-4",
        "title": "Healthy Spaces (Không gian Khỏe mạnh)",
        "tension": "Một ngôi nhà toàn bê tông, kính và kim loại dù sang trọng đến đâu cũng mang năng lượng lạnh (Cold Energy). Bạn cảm thấy thiếu sinh khí.",
        "belief": "Nhà sang là phải tối giản, lạnh lùng.",
        "core": "Nghệ thuật mang Rung động (Vibration) và Sự sống (Life Force) vào những bức tường chết. Một bức tranh 'Vibrant' là vitamin cho không gian.",
        "reframe": "Nghệ thuật là phong thủy hiện đại, là liều thuốc cho không gian sống.",
        "mechanism": "High Vibe Art."
    },
    {
        "id": "ins-5",
        "title": "The Investment of Joy (Khoản đầu tư Niềm vui)",
        "tension": "Bạn đầu tư đất đai, chứng khoán nhưng chẳng bao giờ được 'ngắm' hay 'sờ' chúng hàng ngày. Bạn muốn một tài sản vừa sinh lời vừa mang lại niềm vui.",
        "belief": "Mua tranh là tiêu sản.",
        "core": "Nghệ thuật là tài sản duy nhất bạn có thể thưởng thức mỗi ngày (Emotional ROI) trong khi giá trị của nó vẫn tăng theo thời gian (Financial ROI).",
        "reframe": "Đầu tư vào Cảm xúc là khoản đầu tư lãi nhất.",
        "mechanism": "Joyful Asset."
    }
]