{
    "functional": [
        {
            "id": "func-1",
            "title": "Energy Audit (Kiểm toán năng lượng)",
            "description": "Nhận diện rõ ràng lỗ hổng năng lượng và thời gian trong cuộc sống hiện tại để ngăn chặn sự kiệt sức.",
            "situation": "Cảm thấy mệt mỏi dù đã cố gắng cân bằng công việc và gia đình, không hiểu tại sao năng lượng cứ 'chảy máu' mãi.",
            "context": "Phụ nữ thành đạt thường bị rò rỉ năng lượng từ nhiều nguồn không nhận ra.",
            "triggers": [
                "Luôn cảm thấy kiệt sức dù ngủ đủ giấc.",
                "Không biết thời gian của mình đã đi đâu.",
                "Muốn tìm ra 'lỗ thủng' đang làm mất năng lượng."
            ],
            "desiredOutcome": [
                "Nhìn thấy rõ ràng nơi nào đang rò rỉ năng lượng.",
                "Có bản đồ thời gian và năng lượng cụ thể.",
                "Biết cách 'vá' lỗ hổng để giữ năng lượng."
            ]
        },
        {
            "id": "func-2",
            "title": "Boundary Setting (Thiết lập ranh giới)",
            "description": "Xây dựng ranh giới rõ ràng giữa công việc và cuộc sống để bảo vệ năng lượng cá nhân.",
            "situation": "Không biết cách nói 'không', luôn cảm thấy phải đáp ứng mọi yêu cầu từ công việc và gia đình.",
            "context": "Thiếu ranh giới khiến năng lượng bị khai thác liên tục.",
            "triggers": [
                "Cảm thấy bị xâm phạm không gian cá nhân.",
                "Không dám từ chối yêu cầu của người khác.",
                "Muốn có thời gian cho bản thân mà không tội lỗi."
            ],
            "desiredOutcome": [
                "Thiết lập được ranh giới healthy.",
                "Tự tin nói 'không' khi cần.",
                "Bảo vệ được năng lượng cá nhân."
            ]
        },
        {
            "id": "func-3",
            "title": "Reconnection Strategy (Chiến lược tái kết nối)",
            "description": "Xây dựng kế hoạch cụ thể để tái kết nối với chồng và con sau thời gian dài mất liên lạc cảm xúc.",
            "situation": "Muốn gần gũi với gia đình nhưng không biết bắt đầu từ đâu, cảm thấy xa cách dù sống chung nhà.",
            "context": "Khoảng cách cảm xúc đã hình thành lâu, cần chiến lược rõ ràng.",
            "triggers": [
                "Con cái không muốn chia sẻ với mình nữa.",
                "Chồng trở nên xa lạ.",
                "Muốn xây dựng lại intimacy trong gia đình."
            ],
            "desiredOutcome": [
                "Có roadmap tái kết nối cụ thể.",
                "Biết cách mở lại cuộc trò chuyện.",
                "Xây dựng lại sự gần gũi từng ngày."
            ]
        },
        {
            "id": "func-4",
            "title": "Self-Care System (Hệ thống chăm sóc bản thân)",
            "description": "Thiết lập thói quen chăm sóc bản thân bền vững, không phải tự hy sinh mà là tự yêu thương.",
            "situation": "Biết cần chăm sóc bản thân nhưng không có hệ thống, thường bỏ bê vì ưu tiên người khác.",
            "context": "Self-care không phải luxury mà là necessity để duy trì năng lượng.",
            "triggers": [
                "Luôn đặt người khác lên trước.",
                "Cảm thấy tội lỗi khi dành thời gian cho mình.",
                "Muốn xây dựng thói quen yêu bản thân."
            ],
            "desiredOutcome": [
                "Có hệ thống self-care rõ ràng.",
                "Thực hiện đều đặn không tội lỗi.",
                "Cảm thấy đủ đầy để cho đi."
            ]
        }
    ],
    "emotional": [
        {
            "id": "emo-1",
            "title": "Inner Peace (Bình an nội tại)",
            "description": "Đạt được trạng thái bình an sâu sắc bên trong, không bị lay động bởi áp lực bên ngoài.",
            "situation": "Mệt mỏi với sự hỗn loạn trong đầu, muốn tìm được sự yên tĩnh và clarity.",
            "context": "Bình an là nền tảng của mọi hạnh phúc và sức hút.",
            "triggers": [
                "Cảm thấy luôn bất an và lo lắng.",
                "Muốn có inner calm giữa cuộc sống hối hả.",
                "Khao khát sự yên bình trong tâm hồn."
            ],
            "desiredOutcome": [
                "Cảm nhận được bình an sâu sắc.",
                "Không bị cuốn theo drama bên ngoài.",
                "Có năng lượng ổn định và centered."
            ]
        },
        {
            "id": "emo-2",
            "title": "Self-Love (Yêu bản thân)",
            "description": "Chuyển hóa từ tự bỏ bê, tự phê phán sang thực sự yêu thương và trân trọng bản thân.",
            "situation": "Nhận ra mình đã quá khắt khe với bản thân, muốn học cách yêu mình như yêu người khác.",
            "context": "Không thể cho đi tình yêu nếu bản thân đang rỗng.",
            "triggers": [
                "Luôn tự trách mình khi có lỗi.",
                "Cảm thấy không xứng đáng được yêu thương.",
                "Muốn học cách compassion với chính mình."
            ],
            "desiredOutcome": [
                "Yêu thương bản thân chân thành.",
                "Chấp nhận điểm yếu của mình.",
                "Cảm thấy worthy và đủ tốt."
            ]
        },
        {
            "id": "emo-3",
            "title": "Hope & Renewal (Hy vọng & Tái sinh)",
            "description": "Tin vào khả năng chuyển hóa, tin rằng cuộc sống hạnh phúc đủ đầy là có thể.",
            "situation": "Sau nhiều lần thất vọng, cần hy vọng mới về một cuộc sống thực sự vui vẻ.",
            "context": "Đã thử nhiều cách nhưng chưa thấy thay đổi thực sự.",
            "triggers": [
                "Cảm thấy bế tắc với cuộc sống hiện tại.",
                "Muốn tin vào khả năng transformation.",
                "Cần thấy ánh sáng cuối đường hầm."
            ],
            "desiredOutcome": [
                "Hy vọng về cuộc sống mới.",
                "Tin vào khả năng thay đổi của mình.",
                "Cảm nhận được sự tái sinh bên trong."
            ]
        }
    ],
    "social": [
        {
            "id": "soc-1",
            "title": "Magnetic Presence (Từ tính - Sức hút tự nhiên)",
            "description": "Trở thành người phụ nữ có 'Từ tính' - năng lượng bình an tỏa ra làm chồng con luôn muốn ở gần.",
            "situation": "Muốn gia đình tự nhiên muốn quay về với mình, không phải vì bổn phận mà vì sức hút.",
            "context": "Năng lượng bình an mạnh hơn bất kỳ nhân sắc nào.",
            "triggers": [
                "Chồng con xa lánh dù mình cố gắng.",
                "Muốn có sức hút tự nhiên không cần cố.",
                "Muốn gia đình feel good khi ở gần mình."
            ],
            "desiredOutcome": [
                "Tỏa ra năng lượng bình an hút người.",
                "Gia đình tự nhiên muốn ở gần.",
                "Trở thành 'home' cảm xúc của gia đình."
            ]
        },
        {
            "id": "soc-2",
            "title": "Role Model (Hình mẫu truyền cảm hứng)",
            "description": "Trở thành nguồn cảm hứng cho phụ nữ khác về sự chuyển hóa từ kiệt sức sang bình an.",
            "situation": "Muốn chia sẻ hành trình transformation để inspire phụ nữ khác.",
            "context": "Transformation story có sức mạnh to lớn.",
            "triggers": [
                "Thấy nhiều phụ nữ đang struggle giống mình.",
                "Muốn chia sẻ bài học đã học được.",
                "Muốn tạo impact tích cực cho cộng đồng."
            ],
            "desiredOutcome": [
                "Được nhìn nhận là role model.",
                "Inspire phụ nữ khác transformation.",
                "Tạo ripple effect tích cực."
            ]
        }
    ]
}