[
  {
    "id": "vitamind-seg-1",
    "title": "The Overwhelmed Urban Professional (Người trẻ Đô thị Quá tải)",
    "isPrimary": true,
    "description": "Người trẻ đô thị (22-45 tuổi) đang sống trong áp lực công việc cao, thường xuyên stress, lo âu và mất ngủ. Họ biết mình cần chăm sóc sức khỏe tinh thần nhưng chưa sẵn sàng gặp bác sĩ tâm lý (stigma) và bị ngợp bởi thông tin wellness rác trên mạng. Họ cần một kho tài nguyên đáng tin cậy, xuất hiện đúng lúc vào những khoảnh khắc quan trọng (trước ngủ, sáng thức dậy, giữa ngày overwhelm).",
    "painPoints": [
      "Não không tắt được lúc 2:00 AM, nằm trằn trọc suy nghĩ vô tận",
      "Stress và lo âu tích tụ nhưng không biết giải tỏa như thế nào",
      "Bị ngợp bởi thông tin wellness rác, không biết nguồn nào đáng tin",
      "Chưa sẵn sàng gặp bác sĩ tâm lý vì sợ bị dán nhãn 'có vấn đề'",
      "Áp lực phải duy trì streak/kỷ luật khiến thêm stress",
      "Thiếu tập trung, năng suất làm việc giảm sút"
    ]
  },
  {
    "id": "vitamind-seg-2",
    "title": "The Self-Care Seeker (Người tìm kiếm Tự chăm sóc)",
    "isPrimary": false,
    "description": "Người đã nhận thức được tầm quan trọng của sức khỏe tinh thần và muốn chủ động chăm sóc bản thân. Họ đã thử nhiều app wellness nhưng thất vọng vì quá áp lực (streak), quá phức tạp hoặc nội dung kém chất lượng. Họ cần một không gian an toàn, không phán xét, với nội dung chất lượng cao dựa trên khoa học.",
    "painPoints": [
      "App wellness khác quá áp lực với streak, làm thêm stress",
      "Nội dung wellness trên mạng thiếu căn cứ khoa học",
      "Cảm thấy cô đơn trong hành trình chăm sóc bản thân",
      "Không biết bắt đầu từ đâu với quá nhiều lựa chọn"
    ]
  },
  {
    "id": "vitamind-seg-3",
    "title": "The Crisis Navigator (Người vượt Khủng hoảng)",
    "isPrimary": false,
    "description": "Người đang trải qua giai đoạn khó khăn (thất nghiệp, chia tay, mất người thân, burnout) và cần công cụ hỗ trợ tức thì để vượt qua những khoảnh khắc khủng hoảng cảm xúc. Họ cần sự hỗ trợ ngay lập tức, không cần đăng ký phức tạp hay cam kết dài hạn.",
    "painPoints": [
      "Cảm xúc tràn ngập, không kiểm soát được",
      "Cần hỗ trợ ngay lập tức nhưng không thể chờ lịch hẹn bác sĩ",
      "Sợ bị phán xét khi chia sẻ với người khác",
      "Cảm giác bất lực, không biết làm gì để cảm thấy tốt hơn"
    ]
  }
]