[
  {
    "id": "ins-1",
    "title": "The 'Modern' Failure (Sự thất bại của Hiện đại)",
    "tension": "Bạn có tiền, bạn tiếp cận được y học hiện đại nhất, nhưng tại sao cơn đau đầu và nỗi lo âu vẫn quay lại? Bạn bắt đầu nghi ngờ những viên thuốc màu trắng.",
    "belief": "Hiện đại là tốt nhất. Thuốc tây là nhanh nhất.",
    "core": "Y học hiện đại giỏi cắt cơn (Symptom), nhưng Tự nhiên mới giỏi nuôi dưỡng (Nurture). Cơ thể bạn không thiếu thuốc, nó thiếu sự cân bằng tự nhiên.",
    "reframe": "Đừng chỉ chữa bệnh, hãy 'dưỡng' lại sự sống bên trong.",
    "mechanism": "Natural Balance Restoration.",
    "hooks": [
      "Tại sao uống thuốc mãi không khỏi?",
      "Càng chữa càng bệnh",
      "Về với Tự nhiên"
    ],
    "angle": "Góc nhìn Tự nhiên",
    "promise": "Giải pháp chữa lành không tác dụng phụ, xử lý tận gốc vấn đề.",
    "rtb": "Liệu pháp Dưỡng tâm thể thuần tự nhiên."
  },
  {
    "id": "ins-2",
    "title": "The Cycle of Stress (Vòng lặp Áp lực)",
    "tension": "Đi làm về mệt -> Stress -> Mất ngủ -> Sáng dậy mệt -> Lại đi làm. Bạn mắc kẹt trong vòng lặp này năm này qua năm khác.",
    "belief": "Nghỉ ngơi cuối tuần là đủ để hồi phục.",
    "core": "Nghỉ ngơi thụ động (ngủ nướng, xem phim) không giải phóng được độc tố stress tích tụ trong tế bào. Bạn cần một quy trình 'xả' độc chủ động (Active Release).",
    "reframe": "Không phải nghỉ ngơi, mà là 'Thanh lọc' tâm trí.",
    "mechanism": "Active Stress Release.",
    "hooks": [
      "Ngủ bao nhiêu cũng không lại sức?",
      "Xả độc tâm trí",
      "Thoát khỏi vòng lặp mệt mỏi"
    ],
    "angle": "Góc nhìn Thanh lọc",
    "promise": "Cắt đứt vòng lặp stress, đưa cơ thể về trạng thái thư giãn sâu.",
    "rtb": "Quy trình tác động sâu vào hệ thần kinh thực vật."
  },
  {
    "id": "ins-3",
    "title": "Sustainable Health (Sức khỏe Bền vững)",
    "tension": "Bạn sợ những giải pháp 'xổi', đẹp nhanh, khỏe nhanh nhưng sau đó 'sập' nhanh. Bạn muốn một cái gì đó đi đường dài cùng bạn.",
    "belief": "Nhanh mới là hiệu quả.",
    "core": "Nhanh là vay mượn của tương lai. Bền vững là tích lũy mỗi ngày. Sức khỏe thực sự giống như trồng cây, cần thời gian và sự nuôi dưỡng âm thầm.",
    "reframe": "Đầu tư cho 'Gốc rễ' thay vì chạy theo 'Ngọn'.",
    "mechanism": "Sustainable Nurturing.",
    "hooks": [
      "Sức khỏe không phải cuộc đua nước rút",
      "Chậm mà chắc",
      "Vẻ đẹp từ gốc rễ"
    ],
    "angle": "Góc nhìn Bền vững",
    "promise": "Cải thiện chậm nhưng chắc chắn, không lo tái phát.",
    "rtb": "Phương pháp an toàn, thân thiện, không hóa chất."
  },
  {
    "id": "ins-4",
    "title": "Mind-Body Disconnect (Mất kết nối Thân-Tâm)",
    "tension": "Đầu thì muốn làm việc nhưng thân thì biểu tình. Bạn cảm thấy mình đang 'lái' một chiếc xe (cơ thể) rệu rã mà không biết cách bảo dưỡng.",
    "belief": "Cơ thể chỉ là công cụ để phục vụ công việc.",
    "core": "Khi Thân và Tâm mất kết nối, bệnh tật xuất hiện như một lời kêu cứu. Bạn cần học cách 'lắng nghe' và 'hòa giải' với chính cơ thể mình.",
    "reframe": "Đừng ép cơ thể phục vụ, hãy biến nó thành người bạn đồng hành.",
    "mechanism": "Mind-Body Alignment.",
    "hooks": [
      "Cơ thể đang kêu cứu",
      "Hòa giải với chính mình",
      "Lắng nghe tiếng nói bên trong"
    ],
    "angle": "Góc nhìn Kết nối",
    "promise": "Tìm lại sự thống nhất giữa ý chí và cơ thể.",
    "rtb": "Các bài tập và liệu pháp kết nối tâm thể."
  },
  {
    "id": "ins-5",
    "title": "Safe Haven (Điểm tựa An toàn)",
    "tension": "Giữa một thế giới đầy hóa chất, ô nhiễm và áp lực, bạn khao khát một nơi chốn, một giải pháp thực sự 'sạch' và 'lành' để nương tựa.",
    "belief": "Ở đâu cũng độc hại như nhau thôi.",
    "core": "Sự an toàn tuyệt đối (Safety) là nhu cầu xa xỉ nhất hiện nay. Khách hàng không mua sản phẩm, họ mua sự 'Yên tâm'.",
    "reframe": "Không chỉ là chữa bệnh, đó là sự trở về Mái nhà (Safe Haven) của Tự nhiên.",
    "mechanism": "Pure Safety Standard.",
    "hooks": [
      "Nơi trú ẩn bình yên",
      "Sạch - Lành - Xanh",
      "An tâm tuyệt đối"
    ],
    "angle": "Góc nhìn An toàn",
    "promise": "Cam kết an toàn tuyệt đối, thân thiện với cả những cơ địa nhạy cảm nhất.",
    "rtb": "Nguyên liệu và quy trình xanh chuẩn mực từ Mái ấm Việt Nam."
  }
]