{
    "id": "ngoc-cis",
    "name": "Ngọc CIS",
    "tagline": "Bảo dưỡng não bộ - Tắt chế độ sinh tồn",
    "owner": "Ngọc",
    "keywords": [
        "Healing",
        "Neuroscience",
        "Mom",
        "Sleep",
        "Burnout"
    ],
    "description": [
        "Ngọc CIS là dịch vụ 'Bảo dưỡng não bộ' duy nhất tại Việt Nam dành riêng cho các mẹ bầu và mẹ nuôi con nhỏ – những người đang mắc kẹt trong chế độ sinh tồn với mất ngủ kinh niên, mệt mỏi mãn tính, và cảm xúc bất ổn đến mức không còn nhận ra chính mình. Sinh ra từ sự thấu hiểu sâu sắc về giai đoạn khó khăn nhất trong hành trình làm mẹ, Ngọc CIS hiểu rằng việc hỏi thăm người thân, bạn bè hay đi tư vấn nhiều nơi không giải quyết được vấn đề gốc rễ: não bộ của người mẹ đang quá tải và cần được 'bảo dưỡng' bài bản theo khoa học thần kinh. Với vai trò 'Bác sĩ Tâm Thể', Ngọc CIS mang đến bến đỗ an toàn duy nhất cho những người mẹ đang tuyệt vọng tìm kiếm sự giúp đỡ chuyên môn.",
        "Combo Bảo dưỡng não của Ngọc CIS không chỉ đơn thuần là liệu trình trị liệu – đây là hệ thống chăm sóc sức khỏe toàn diện theo hướng Tâm-Thể kết hợp, dựa trên nền tảng khoa học thần kinh (Neuroscience) và bằng chứng y học (Evidence-based). Từ việc phục hồi giấc ngủ tự nhiên trong 15-20 phút mà không cần thuốc an thần, đến điều tiết cảm xúc để giữ được sự bình tĩnh khi con quấy khóc, và bảo toàn năng lượng để vừa làm việc vừa chăm con – mỗi bước trong lộ trình đều được thiết kế để giải quyết đúng gốc rễ vấn đề thay vì chữa đầu đau đầu, chữa chân đau chân. Ngọc CIS không chỉ giúp mẹ ngủ ngon và hết mệt mỏi, mà còn xóa bỏ cảm giác tội lỗi (Mom Guilt), giúp mẹ kết nối lại với chính mình và tin tưởng vào bản năng làm mẹ.",
        "Ngọc CIS tin rằng khi người mẹ khỏe – cả thể chất lẫn tinh thần – cả gia đình sẽ hạnh phúc. Từ trạng thái mệt mỏi, mất kiểm soát cảm xúc, và mắc kẹt trong vòng xoáy lo âu, các mẹ được chuyển hóa sang phiên bản 'Người mẹ khí chất' – ngủ sâu giấc, tỉnh táo sảng khoái, kiểm soát được cơn giận, và trở thành bến đỗ bình yên cho con. Không chỉ dừng lại ở đó, Ngọc CIS giúp mẹ xây dựng gia đình hòa thuận (Happy Wife, Happy Mom), trở thành tấm gương sống cho con về tình yêu thương bản thân, và cân bằng tốt giữa công việc - gia đình mà không phải hy sinh bất cứ điều gì. Với đội ngũ bác sĩ chuyên môn đồng hành, Ngọc CIS là chỗ dựa vững chắc để mẹ giao phó sức khỏe, tắt chế độ sinh tồn, và bước vào giai đoạn thăng hoa của cuộc đời."
    ]
}