{
    "id": "aurora-english",
    "name": "Aurora English",
    "owner": "Hà Bắc",
    "description": [
        "Aurora English là khóa học Beginner dành cho những người đã đi làm (1-10 năm kinh nghiệm) và sinh viên năm cuối (năm 2-4) – những người đã có vốn tiếng Anh từ 12 năm phổ thông nhưng vẫn bị 'điếc' và 'câm' khi phải giao tiếp thực tế. Sinh ra từ sự thấu hiểu sâu sắc về nỗi đau của những người bỏ lỡ cơ hội thăng tiến vì rào cản ngoại ngữ, Aurora English hiểu rằng vấn đề không nằm ở việc học thêm ngữ pháp hay từ vựng – mà là tâm lý sợ sai, sợ bị đánh giá, và phương pháp học vẹt đã ăn sâu vào tiềm thức. Với sứ mệnh giải phóng học viên khỏi cảm giác 'thấp bé' trước những bạn trẻ giỏi tiếng Anh và nỗi run lẩy bẩy mỗi khi phải mở miệng, Aurora English tập trung vào kỹ năng nghe-nói để học viên có thể giao tiếp tự nhiên, tự tin thuyết trình, và khôi phục lại vị thế xứng đáng với chuyên môn của mình.",
        "Khóa học Beginner của Aurora English không phải là một trung tâm tiếng Anh truyền thống – đây là hành trình 'khai mở tư duy' và giải tỏa rào cản tâm lý thông qua phương pháp học Tư duy & Tâm lý độc quyền. Thay vì nhồi nhét từ vựng vô nghĩa hay chép ngữ pháp, học viên được dẫn dắt để hiểu bản chất (root cause) của ngôn ngữ, tìm thấy niềm vui học tập nội tại, và thay đổi mindset từ 'học vì phải' sang 'học vì muốn'. Trong một Zone an toàn nơi dám mắc lỗi, dám nói, dám là chính mình – học viên được rèn luyện để mở miệng nói tiếng Anh mà không cần dịch trong đầu, thoải mái với accent của mình, và cảm thấy nhẹ nhàng không áp lực. Mỗi bước trong lộ trình đều tập trung vào kỹ năng nghe-nói thực chiến, giúp học viên tự tin giao tiếp trong cuộc họp, thuyết trình bằng tiếng Anh, và cảm thấy mình chuyên nghiệp hơn.",
        "Aurora English tin rằng tiếng Anh không chỉ là một kỹ năng – mà là chìa khóa để khôi phục vị thế, được đồng nghiệp/sếp nhìn nhận đúng năng lực, và mở ra cánh cửa thăng tiến sự nghiệp. Từ trạng thái run lẩy bẩy khi phải nói tiếng Anh, xấu hổ khi dùng Google Dịch trước mặt đồng nghiệp, và ức chế vì không diễn đạt được sự thông minh của mình – học viên được chuyển hóa thành những Global Citizen tự tin, có thể lead team quốc tế, deal mức lương ngàn đô, và được săn đón bởi các headhunter. Không chỉ dừng lại ở đó, Aurora English giúp học viên xây dựng hình ảnh công dân toàn cầu hiện đại, tự do đi bất cứ đâu mình muốn, và trở thành phiên bản tốt hơn của chính mình – nơi tiếng Anh không còn là rào cản mà là tấm hộ chiếu để bước ra thế giới."
    ]
}