{
    "functional": [
        {
            "id": "func-1",
            "title": "Cần lấy lại căn bản để giao tiếp tự nhiên",
            "description": "Tôi cần xây dựng lại nền tảng tiếng Anh vững chắc để có thể giao tiếp tự nhiên, không còn sợ sai, sợ bị đánh giá.",
            "situation": "Ngồi trong cuộc họp với đối tác nước ngoài, tôi muốn phát biểu ý kiến nhưng sợ nói sai ngữ pháp nên đành im lặng.",
            "context": "Tôi đã học tiếng Anh 12 năm phổ thông + Đại học nhưng vẫn bị 'điếc' và 'câm' tiếng Anh.",
            "triggers": [
                "Bỏ lỡ cơ hội thăng tiến vì rào cản ngoại ngữ.",
                "Cảm thấy xấu hổ khi phải dùng Google Dịch trước mặt đồng nghiệp.",
                "Bị sếp phàn nàn về khả năng giao tiếp tiếng Anh."
            ],
            "desiredOutcome": [
                "Có thể mở miệng nói tiếng Anh mà không cần dịch trong đầu.",
                "Tự tin thuyết trình bằng tiếng Anh.",
                "Cảm thấy mình chuyên nghiệp và có giá trị hơn."
            ]
        },
        {
            "id": "func-2",
            "title": "Cần phương pháp học hiểu bản chất",
            "description": "Tôi cần tiếp cận tiếng Anh như một công cụ tư duy, không phải môn học học thuật, để giải tỏa rào cản tâm lý.",
            "situation": "Đến lớp không phải để chép ngữ pháp, mà để được 'khai mở' tư duy, hiểu tại sao người bản xứ lại nói như vậy.",
            "context": "Tôi chán ngấy cách học vẹt, nhồi nhét từ vựng vô nghĩa của các trung tâm truyền thống.",
            "triggers": [
                "Học trước quên sau, không áp dụng được vào thực tế.",
                "Cảm thấy việc học tiếng Anh là một cực hình.",
                "Mất niềm tin vào khả năng ngôn ngữ của bản thân."
            ],
            "desiredOutcome": [
                "Hiểu bản chất của ngôn ngữ, không chỉ học thuộc.",
                "Tìm thấy niềm vui và động lực học tập nội tại.",
                "Thay đổi tư duy từ 'học vì phải' sang 'học vì muốn'."
            ]
        }
    ],
    "emotional": [
        {
            "id": "emo-1",
            "title": "Muốn khôi phục vị thế của mình",
            "description": "Tôi muốn cảm thấy mình tài giỏi, thông minh xứng đáng với chuyên môn, không bị tiếng Anh làm 'lu mờ' năng lực.",
            "situation": "Khi có thể tranh luận sòng phẳng với đối tác nước ngoài, tôi cảm thấy mình được tôn trọng thực sự.",
            "context": "Tôi rất giỏi chuyên môn nhưng bị coi thường chỉ vì tiếng Anh kém.",
            "triggers": [
                "Cảm thấy mình 'thấp bé' trước những bạn trẻ giỏi tiếng Anh.",
                "Bị coi là 'lỗi thời' trong môi trường quốc tế.",
                "Ức chế vì không diễn đạt được sự thông minh của mình."
            ],
            "desiredOutcome": [
                "Tự hào về bản thân, khẳng định năng lực.",
                "Được đồng nghiệp/sếp nhìn nhận đúng năng lực.",
                "Cảm thấy quyền lực trong công việc."
            ]
        },
        {
            "id": "emo-2",
            "title": "Muốn vượt qua nỗi sợ sai",
            "description": "Tôi muốn có một Zone an toàn để dám mắc lỗi, dám nói, dám thể hiện mà không sợ bị phán xét.",
            "situation": "Đứng lên nói sai một câu nhưng được giáo viên và bạn học khích lệ thay vì cười chê.",
            "context": "Tâm lý sợ sai ăn sâu vào tiềm thức tôi khi học ngoại ngữ.",
            "triggers": [
                "Run lẩy bẩy khi phải nói tiếng Anh.",
                "Luôn ám ảnh việc phải nói chuẩn ngữ pháp 100%.",
                "Sợ bị người khác đánh giá accent (giọng)."
            ],
            "desiredOutcome": [
                "Thoải mái mắc lỗi để trưởng thành.",
                "Cảm thấy nhẹ nhàng, không áp lực.",
                "Dám là chính mình khi dùng ngôn ngữ khác."
            ]
        }
    ],
    "social": [
        {
            "id": "soc-1",
            "title": "Muốn xây dựng hình ảnh Global Citizen",
            "description": "Tôi muốn xây dựng hình ảnh một công dân toàn cầu, hiện đại, có khả năng kết nối và làm việc trong môi trường đa văn hóa.",
            "situation": "Đi du lịch nước ngoài tự tin order món ăn, hỏi đường, kết bạn với người bản xứ.",
            "context": "Tiếng Anh là tấm hộ chiếu để tôi bước ra thế giới.",
            "triggers": [
                "Thấy bạn bè đi nước ngoài check-in sang chảnh.",
                "Muốn đi du học hoặc định cư.",
                "Muốn mở rộng network quốc tế."
            ],
            "desiredOutcome": [
                "Được ngưỡng mộ về phong cách sống.",
                "Tự do đi bất cứ đâu mình muốn.",
                "Kết nối không biên giới."
            ]
        },
        {
            "id": "soc-2",
            "title": "Muốn thăng tiến trong sự nghiệp",
            "description": "Tôi muốn chứng minh sự thăng tiến trong sự nghiệp, khẳng định vị trí quản lý/lãnh đạo.",
            "situation": "Tự tin lead một team dự án có thành viên là người nước ngoài.",
            "context": "Ở các vị trí cao cấp, tiếng Anh là yêu cầu bắt buộc.",
            "triggers": [
                "Cơ hội thăng chức đến nhưng lụt mất vì tiếng Anh.",
                "Muốn deal mức lương cao hơn (ngàn đô).",
                "Sợ bị đào thải nếu không cập nhật."
            ],
            "desiredOutcome": [
                "Thăng tiến lên vị trí cao hơn.",
                "Thu nhập tăng trưởng đột phá.",
                "Được săn đón bởi headhunter."
            ]
        }
    ]
}