{
    "functional": [
        {
            "id": "func-1",
            "title": "Natural Healing (Tự chữa lành)",
            "description": "Cung cấp nguồn dinh dưỡng enzyme tươi sống để cơ thể kích hoạt khả năng tự chữa lành tự nhiên.",
            "situation": "Sau đợt ốm dài ngày hoặc dùng nhiều kháng sinh, cơ thể cần phục hồi nhanh chóng mà không muốn nạp thêm thuốc tây.",
            "context": "Niềm tin vào khả năng tự phục hồi của cơ thể nếu được cung cấp đúng nguyên liệu.",
            "triggers": [
                "Cảm thấy cơ thể nhiễm độc, nặng nề.",
                "Muốn 'reset' lại hệ miễn dịch.",
                "Tìm kiếm giải pháp dinh dưỡng thay thế thuốc."
            ],
            "desiredOutcome": [
                "Cơ thể phục hồi tự nhiên.",
                "Cảm giác nhẹ nhõm, thanh khiết.",
                "Giảm phụ thuộc vào y tế can thiệp."
            ]
        },
        {
            "id": "func-2",
            "title": "Maximum Nutrition Absorption",
            "description": "Nạp lượng vitamin và khoáng chất gấp nhiều lần ăn thô nhờ công nghệ ép lạnh thủy lực Good Nature X-1.",
            "situation": "Biết mình ăn không đủ rau xanh mỗi ngày và muốn tìm cách bổ sung nhanh nhất, hiệu quả nhất.",
            "context": "Cuộc sống bận rộn không cho phép nhai hàng kg rau mỗi ngày.",
            "triggers": [
                "Lo lắng vì chế độ ăn thiếu rau trầm trọng.",
                "Muốn tận dụng công nghệ để tối ưu sức khỏe.",
                "Tìm kiếm loại nước ép giữ được trọn vẹn dưỡng chất."
            ],
            "desiredOutcome": [
                "Nạp đủ dinh dưỡng chỉ trong 1 chai.",
                "Hấp thụ trực tiếp vào máu nhanh chóng.",
                "Hiệu quả rõ rệt trên da và tóc."
            ]
        },
        {
            "id": "func-3",
            "title": "Digestive Rest (Gut Health)",
            "description": "Cho hệ tiêu hóa nghỉ ngơi (Digestive Rest) bằng chế độ dinh dưỡng dạng lỏng, loại bỏ chất xơ không hòa tan tạm thời.",
            "situation": "Sau những ngày lễ tết ăn uống quá đà, bụng dạ ậm ạch khó tiêu.",
            "context": "Hệ tiêu hóa bị quá tải cần được nghỉ phép.",
            "triggers": [
                "Đầy bụng, khó tiêu kéo dài.",
                "Cảm thấy mệt mỏi sau khi ăn.",
                "Muốn thanh lọc đường ruột."
            ],
            "desiredOutcome": [
                "Bụng nhẹ, tiêu hóa thông suốt.",
                "Cảm giác 'body zero' sảng khoái.",
                "Tái tạo năng lượng từ bên trong."
            ]
        }
    ],
    "emotional": [
        {
            "id": "emo-1",
            "title": "Trust in Purity (Sự tin cậy)",
            "description": "An tâm tuyệt đối khi biết nguồn nguyên liệu đến từ canh tác hướng hữu cơ của người K'Ho và các nông trại uy tín.",
            "situation": "Cầm chai nước ép lên uống mà không phải lo lắng về dư lượng thuốc trừ sâu hay hóa chất bảo quản.",
            "context": "Nỗi sợ thực phẩm bẩn tràn lan trên thị trường.",
            "triggers": [
                "Ám ảnh về ung thư do thực phẩm bẩn.",
                "Muốn dành điều tốt nhất cho bản thân/gia đình.",
                "Cảm động trước câu chuyện canh tác tử tế."
            ],
            "desiredOutcome": [
                "Bình an trong tâm trí (Peace of mind).",
                "Cảm giác được bảo vệ.",
                "Tin tưởng vào sự lựa chọn của mình."
            ]
        },
        {
            "id": "emo-2",
            "title": "Self-Love & Care",
            "description": "Cảm nhận sâu sắc tình yêu thương bản thân qua hành động chăm sóc cơ thể bằng những gì tinh túy nhất.",
            "situation": "Tự thưởng cho mình một liệu trình Juice Cleanse như một món quà sau dự án căng thẳng.",
            "context": "Coi sức khỏe là tài sản vô giá cần được nâng niu.",
            "triggers": [
                "Thấy mình đã bỏ bê bản thân quá lâu.",
                "Muốn kết nối lại với cơ thể.",
                "Cần một nghi thức yêu thương bản thân mỗi sáng."
            ],
            "desiredOutcome": [
                "Hạnh phúc khi biết mình đang sống tốt.",
                "Tự hào về lối sống kỷ luật.",
                "Cảm giác được chữa lành tâm hồn."
            ]
        },
        {
            "id": "emo-3",
            "title": "Hope & Renewal",
            "description": "Niềm hy vọng về một sự thay đổi tích cực, một khởi đầu mới cho sức khỏe và vóc dáng.",
            "situation": "Nhìn thấy sự thay đổi tích cực của Founder và cộng đồng, nhen nhóm hy vọng mình cũng làm được.",
            "context": "Đã thất bại nhiều lần với các phương pháp giảm cân/detox khác.",
            "triggers": [
                "Cảm thấy bế tắc với cân nặng hiện tại.",
                "Được truyền cảm hứng từ câu chuyện thật.",
                "Muốn thay đổi cuộc đời từ những thói quen nhỏ."
            ],
            "desiredOutcome": [
                "Lạc quan về tương lai sức khỏe.",
                "Cảm thấy đầy động lực và hy vọng.",
                "Tin rằng mình có thể thay đổi."
            ]
        }
    ],
    "social": [
        {
            "id": "soc-1",
            "title": "Green Lifestyle Leader",
            "description": "Được công nhận là người tiên phong trong lối sống xanh, văn minh và có trách nhiệm với môi trường/cộng đồng.",
            "situation": "Chia sẻ về việc ủng hộ nông nghiệp bền vững và người K'Ho thông qua việc dùng True Juice.",
            "context": "Xu hướng tiêu dùng có đạo đức (Ethical Consumption).",
            "triggers": [
                "Muốn lan tỏa giá trị tốt đẹp.",
                "Được bạn bè ngưỡng mộ vì lối sống chất.",
                "Thể hiện sự hiểu biết sâu sắc về nguồn gốc thực phẩm."
            ],
            "desiredOutcome": [
                "Xây dựng hình ảnh người có tầm ảnh hưởng tích cực.",
                "Được tôn trọng vì sự tử tế.",
                "Kết nối với cộng đồng tinh hoa cùng giá trị."
            ]
        },
        {
            "id": "soc-2",
            "title": "Educated Consumer",
            "description": "Thể hiện mình là người tiêu dùng thông thái, biết phân biệt giá trị thật (Real Juice) với hàng công nghiệp giả danh.",
            "situation": "Giải thích cho bạn bè sự khác biệt giữa ép lạnh thủy lực và máy ép thường.",
            "context": "Nhu cầu khẳng định kiến thức và gu thẩm mỹ tinh tế.",
            "triggers": [
                "Không muốn bị coi là người dễ dãi, xuề xòa.",
                "Muốn thể hiện sự sành sỏi.",
                "Tự hào khi dùng sản phẩm Top 1 thị trường."
            ],
            "desiredOutcome": [
                "Được đánh giá là người hiểu biết (Knowledgeable).",
                "Nâng tầm vị thế trong mắt người khác.",
                "Trở thành 'chuyên gia' trong nhóm bạn."
            ]
        },
        {
            "id": "soc-3",
            "title": "Inspirational Figure",
            "description": "Trở thành nguồn cảm hứng sống khỏe cho gia đình và đồng nghiệp noi theo.",
            "situation": "Đồng nghiệp tò mò và muốn uống thử khi thấy bạn dùng True Juice mỗi sáng.",
            "context": "Mong muốn tác động tích cực đến những người xung quanh.",
            "triggers": [
                "Thấy người thân ốm đau vì lối sống kém.",
                "Muốn con cái học theo thói quen tốt.",
                "Muốn xây dựng văn hóa sức khỏe tại công sở."
            ],
            "desiredOutcome": [
                "Được mọi người yêu mến và làm theo.",
                "Tạo ra làn sóng sống khỏe quanh mình.",
                "Cảm thấy có ích cho cộng đồng."
            ]
        }
    ]
}