{
    "functional": [
        {
            "id": "func-1",
            "title": "Cần chọn quà nhanh trong 5 phút",
            "description": "Tôi cần tìm được món quà tinh tế, sang trọng, đầy ý nghĩa chỉ trong 5 phút vì bận rộn và deadline gấp.",
            "situation": "Sắp đến 20/10, sếp giao mua quà cho đối tác nữ VIP, ngân sách cao nhưng deadline gấp, tôi không có thời gian đi tìm.",
            "context": "Tôi bận rộn, sợ mua sai, sợ quà quê mùa hoặc không xứng tầm với người nhận.",
            "triggers": [
                "Quên ngày lễ/kỷ niệm quan trọng đến gần.",
                "Bí ý tưởng vì năm ngoái đã tặng hoa/son rồi.",
                "Sợ mua phải hàng fake/kém chất lượng làm mất mặt."
            ],
            "desiredOutcome": [
                "Chọn xong quà nhanh gọn, được ship hỏa tốc.",
                "Quà được gói đẹp, sang trọng, có thiệp viết tay.",
                "Người nhận 'Wow' ngay khi mở hộp."
            ]
        },
        {
            "id": "func-2",
            "title": "Muốn quà độc bản, chất lượng cao",
            "description": "Tôi muốn mọi món đồ trong hộp quà đều là hàng tuyển chọn kỹ lưỡng, có nguồn gốc rõ ràng và gu thẩm mỹ cao.",
            "situation": "Người nhận là người kỹ tính, sành điệu, nếu tặng đồ đại trà họ sẽ biết ngay.",
            "context": "Tôi tin giá trị món quà không nằm ở giá tiền mà ở sự tâm ý và độ tinh tế.",
            "triggers": [
                "Sợ tặng bánh/trà kém chất lượng.",
                "Sợ các set quà công nghiệp nhìn rẻ tiền.",
                "Muốn món quà phải độc bản, không ai có."
            ],
            "desiredOutcome": [
                "Chất lượng sản phẩm hoàn hảo, đáng tin cậy.",
                "Sự phối hợp màu sắc, mùi hương hài hòa.",
                "Cảm thấy an tâm về uy tín thương hiệu."
            ]
        },
        {
            "id": "func-3",
            "title": "Cần quà gấp để xử lý khủng hoảng",
            "description": "Tôi cần cứu nguy cho tình huống quên ngày kỷ niệm hoặc cần quà gấp để ngoại giao.",
            "situation": "Facebook nhắc mới nhớ hôm nay là kỷ niệm ngày cưới, đang đi làm không thể chạy đi mua.",
            "context": "Cuộc sống bận rộn khiến tôi dễ quên những dịp quan trọng.",
            "triggers": [
                "Facebook nhắc ngày sinh nhật bạn thân.",
                "Sếp đột xuất bảo đi thăm đối tác ốm.",
                "Cần quà xin lỗi gấp để hàn gắn."
            ],
            "desiredOutcome": [
                "Có quà trình diện đúng giờ.",
                "Món quà chỉn chu như đã chuẩn bị từ lâu.",
                "Thở phào nhẹ nhõm, tránh được rắc rối."
            ]
        }
    ],
    "emotional": [
        {
            "id": "emo-1",
            "title": "Muốn tự tin về gu thẩm mỹ của mình",
            "description": "Tôi muốn cảm thấy mình là người có gu, tinh tế và hiểu tâm lý người nhận khi chọn được món quà đẹp.",
            "situation": "Trao món quà cho người yêu/vợ, thấy cô ấy mắt sáng lên và khoe ngay với bạn bè, tôi phổng mũi tự hào.",
            "context": "Tặng quà là bài test về sự thấu hiểu và độ tinh tế của tôi.",
            "triggers": [
                "Sợ bị chê là 'khô khan', 'vô tâm'.",
                "Muốn gây ấn tượng mạnh với người nhận.",
                "Muốn thể hiện tình yêu/sự trân trọng không cần lời nói."
            ],
            "desiredOutcome": [
                "Được khen là 'Tâm lý thế', 'Tinh tế quá'.",
                "Khẳng định đẳng cấp/phong cách cá nhân.",
                "Cảm xúc thăng hoa trong mối quan hệ."
            ]
        },
        {
            "id": "emo-2",
            "title": "Muốn hào hứng khi tặng quà",
            "description": "Tôi muốn biến việc tặng quà từ nghĩa vụ (phải làm) thành niềm vui (muốn làm), háo hức chờ phản ứng người nhận.",
            "situation": "Cầm hộp quà đẹp trên tay đến mức chính mình còn muốn giữ lại, cảm giác trao đi một tác phẩm nghệ thuật.",
            "context": "Tặng những món quà nhàm chán khiến cả tôi và người nhận đều gượng gạo.",
            "triggers": [
                "Cảm thấy việc chọn quà là gánh nặng.",
                "Sợ người nhận nhận quà xong cất vào góc tủ.",
                "Muốn tạo ra khoảnh khắc đáng nhớ."
            ],
            "desiredOutcome": [
                "Người nhận xúc động, có thể rơi nước mắt.",
                "Cảm giác kết nối cảm xúc mãnh liệt.",
                "Niềm hạnh phúc lan tỏa cho cả hai."
            ]
        },
        {
            "id": "emo-3",
            "title": "Muốn thoát khỏi stress lựa chọn",
            "description": "Tôi muốn giải phóng bản thân khỏi áp lực phải lựa chọn giữa hàng nghìn món quà trên các sàn TMĐT.",
            "situation": "Lướt Shopee 2 tiếng mà vẫn không chốt được món nào vì quá nhiều lựa chọn loạn xạ.",
            "context": "Càng nhiều lựa chọn càng khó chọn, tôi cảm thấy mệt mỏi và đau đầu.",
            "triggers": [
                "Mệt mỏi, đau đầu vì phải so sánh giá/review.",
                "Sợ chọn sai, sợ bị hớ.",
                "Muốn ai đó chọn hộ cho mình."
            ],
            "desiredOutcome": [
                "Quyết định mua nhanh chóng trong 5 phút.",
                "Cảm thấy nhẹ đầu, không còn áp lực.",
                "Tin tưởng vào sự lựa chọn của chuyên gia."
            ]
        }
    ],
    "social": [
        {
            "id": "soc-1",
            "title": "Muốn thắt chặt mối quan hệ",
            "description": "Tôi muốn sử dụng quà tặng để hàn gắn, hâm nóng hoặc nâng tầm mối quan hệ quan trọng.",
            "situation": "Dùng món quà để làm hòa với vợ sau trận cãi vã, hoặc cảm ơn sếp đã dìu dắt mình.",
            "context": "Lời nói gió bay, nhưng một món quà đúng lúc có sức nặng ngàn cân.",
            "triggers": [
                "Mối quan hệ đang lạnh nhạt, cần hâm nóng.",
                "Muốn bày tỏ lòng biết ơn nhưng ngại nói.",
                "Muốn tạo thiện cảm trong lần đầu gặp gỡ."
            ],
            "desiredOutcome": [
                "Gương vỡ lại lành, tình cảm mặn nồng hơn.",
                "Đối tác tin tưởng, ký hợp đồng suôn sẻ.",
                "Gia đình hòa thuận, hạnh phúc."
            ]
        },
        {
            "id": "soc-2",
            "title": "Muốn được khen ngợi công khai",
            "description": "Tôi muốn khi người nhận chia sẻ món quà lên mạng xã hội, mình cũng được 'thơm lây' về sự chu đáo.",
            "situation": "Vợ đăng story Facebook khoe quà, tag tôi vào với caption: 'Cảm ơn chồng yêu, chu đáo nhất hệ mặt trời'.",
            "context": "Sự công nhận xã hội là nhu cầu lớn của tôi.",
            "triggers": [
                "Muốn mọi người thấy mình có gia đình hạnh phúc.",
                "Muốn khẳng định vị thế trong mắt bạn bè/đồng nghiệp.",
                "Thích được 'nở mày nở mặt'."
            ],
            "desiredOutcome": [
                "Nhận được nhiều like/comment ngưỡng mộ.",
                "Xây dựng hình ảnh 'người đàn ông/đối tác lý tưởng'.",
                "Tăng cường uy tín cá nhân."
            ]
        },
        {
            "id": "soc-3",
            "title": "Muốn cân bằng sự có đi có lại",
            "description": "Tôi muốn đáp lễ một cách tinh tế - món quà không quá rẻ để bị coi thường, không quá đắt khiến người nhận áp lực.",
            "situation": "Được mời đến nhà sếp ăn cơm, tôi cần mang theo món quà vừa vặn, không quá nhiều không quá ít.",
            "context": "Văn hóa tặng quà 'trả nợ' rất tế nhị trong xã hội Á Đông.",
            "triggers": [
                "Sợ bị đánh giá là keo kiệt.",
                "Sợ tặng món quá đắt khiến họ ngại nhận.",
                "Muốn giữ mối quan hệ ở mức 'đẹp'."
            ],
            "desiredOutcome": [
                "Giữ được thể diện cho cả hai bên.",
                "Mối quan hệ trở nên khăng khít hơn.",
                "Được đánh giá là người biết cư xử."
            ]
        }
    ]
}